function Definition() {
	this.defMap = new Map();

	this.add = function(name, array) {
		this.defMap.set(name, array);
	}
	
	this.getMap = function() {
		return this.defMap;
	}
}

var defs = new Definition();

defs.add("报文：1131-银联实体卡进站请求", [
	[2, "报文长度（报文头开始）"],
	[5, "报文类型"],
	[23, "（报文头结束） "],
	[27, "车票主类型 - 类型 - 子类型 - 票卡芯片类型（ 包体开始） "],
	[31, "终端设备编码"],
	[35, "终端设备流水号"],
	[39, "交易站点"],
	[46, "交易日期时间"],
	[47, "模式ID"],
	[66, "主账户"],
	[68, "卡有效期"],
	[70, "卡序列号"],
	[72, "2 磁道数据长度 "],
	[90, "2磁道数据"],
	[92, "IC卡数据长度"],
	[205, "IC卡数据"],
	[207, "银联预授权数据长度"],
	[442, "银联预授权数据"],
	[443, "特定运营类型"],
	[458, "保留（包体结束）"],
	[474, "包尾"]
]);

defs.add("报文：1132--银联实体卡出站请求", [
	[2, "报文长度（报文头开始）"],
	[5, "报文类型"],
	[23, "（报文头结束） "],
	[27, "车票主类型 - 类型 - 子类型 - 票卡芯片类型（ 包体开始） "],
	[31, "终端设备编码"],
	[35, "终端设备流水号"],
	[39, "交易站点"],
	[46, "交易日期时间"],
	[47, "模式ID"],
	[66, "主账户"],
	[68, "卡有效期"],
	[70, "卡序列号"],
	[71, "特定运营类型"],
	[86, "保留（包体结束）"],
	[102, "包尾"]
]);

defs.add("读写器：进出站-银联预授权交易数据内容", [
	[2, "消息类型"],
	[10, "位元表"],
	[19, "【长度】主账号"],
	[22, "交易处理码"],
	[28, "交易金额"],
	[31, "受卡方跟踪号"],
	[40, "【长度】进站站点"],
	[47, "进站时间"],
	[49, "固定值072"],
	[51, ""],
	[52, "固定值06"],
	[70, "（35域）【长度】2磁道数据"],
	[78, "（41域）受卡方终端标识码"],
	[93, "（42域）受卡方标识码"],
	[101, "（43域）受卡方系统标识"],
	[104, "（49域）交易货币代码，固定字符串156"],
	[106, "（55域）长度"],
	[117, "应用密文"],
	[121, "应用信息数据"],
	[143, ""],
	[150, ""],
	[155, ""],
	[170, ""],
	[188, ""],
	[193, ""],
	[208, ""],
	[219, "接口设备序列号"],
	[227, "自定义域"],
	[235, "MAC"],
]);

defs.add("交易数据：金融IC卡交易数据格式", [
	[5, "交易类型-车票主类型-类型-子类型-票卡芯片类型"],
	[13, "SAM卡号"],
	[17, "SAM卡流水号"],
	[24, "交易日期时间"],
	[28, "当前车站"],
	[32, "终端设备标识"],
	[36, "终端设备流水号"],
	[40, "交易金额"],
	[41, "模式ID"],
	[45, ""],
	[46, ""],
	[47, "支付方式"],
	[51, ""],
	[52, "班次类型"],
	[54, "卡有效期"],
	[74, "账户号"],
	[76, "2磁道数据长度"],
	[114, "2磁道数据"],
	[116, "IC卡数据长度"],
	[371, "IC卡数据域内容 "],
	[373, "卡序列号 "],
	[473, "备注 "],
	[474, "特定运营模式 "],
	[527, "保留"],
]);
